Repository: Glimwp/glim-woocommerce
Catalog: languages/glim-woocommerce-*.po
Languages: ro_ro

source: %s of the customers recommend the product
ro_ro: %s dintre clienți recomandă produsul

source: Active Filters
ro_ro: Filtre Active

source: All templates have failed to install.
ro_ro: Toate șabloanele nu au reușit să se instaleze.

source: All templates installed successfully. You can customize them in Site Editor.
ro_ro: Toate șabloanele instalate cu succes. Le puteți personaliza în Editorul site-ului.

source: Awesome, GLIM: WooCommerce extension is activated!
ro_ro: Minunat, GLIM: extensia WooCommerce este activată!

source: Browse the store
ro_ro: Răsfoiți magazinul

source: Cart
ro_ro: Coș

source: Cart Total
ro_ro: Total coș

source: Checkout
ro_ro: Finalizare

source: Color filter
ro_ro: Filtru de culoare

source: Enter the price recommended by the manufacturer.
ro_ro: Introduceți prețul recomandat de producător.

source: Filters
ro_ro: Filtre

source: Give it a star on GitHub
ro_ro: Dați-i o stea pe GitHub

source: Go to Theme Options in order to setup your preferences.
ro_ro: Accesați opțiunile temei pentru a vă configura preferințele.

source: Navigate to the extension settings.
ro_ro: Navigați la setările extensiei.

source: New in store
ro_ro: Nou în magazin

source: Please define an action type.
ro_ro: Definiți un tip de acțiune.

source: Plugin reactivated successfully.
ro_ro: Pluginul a fost reactivat cu succes.

source: Price filter
ro_ro: Filtru de preț

source: Product Item
ro_ro: Articol de produs

source: Query (Products - Search)
ro_ro: Interogare (Produse - Căutare)

source: Query (Products - Section)
ro_ro: Interogare (Produse - Secțiune)

source: Query (Products - Taxonomy)
ro_ro: Interogare (Produse - Taxonomie)

source: Query (Products)
ro_ro: Interogare (Produse)

source: Rating filter
ro_ro: Filtru de evaluare

source: Recommended price (%s)
ro_ro: Preț recomandat (%s)

source: release page
ro_ro: pagina de lansare

source: Settings
ro_ro: Setări

source: Show me the options!
ro_ro: Arată-mi opțiunile!

source: Something went wrong.
ro_ro: Ceva nu a funcționat.

source: Star on GitHub
ro_ro: Dăi stea pe GitHub

source: Stock filter
ro_ro: Filtru stoc

source: Templates array is empty.
ro_ro: Matricea de șabloane este goală.

source: The comment has been sent.
ro_ro: Comentariul a fost trimis.

source: The plugin has been updated, but could not be reactivated. Please reactivate it manually.
ro_ro: Pluginul a fost actualizat, dar nu a putut fi reactivat. Vă rugăm să-l reactivați manual.

source: The review has been sent.
ro_ro: Recenzia a fost trimisă.

source: This extension requires GlimFSE Framework (or a skin) installed and active.
ro_ro: Această extensie necesită GlimFSE Framework (sau un skin) instalat și activ.

source: This extension requires WooCommerce plugin installed and active.
ro_ro: Această extensie necesită instalarea și activarea pluginului WooCommerce.

source: This is the manufacturer's recommended price. The selling price of the product is shown below.
ro_ro: Acesta este prețul recomandat de producător. Pretul de vanzare al produsului este prezentat mai jos.

source: To read the change history for the latest plugin release, please go to the %s.
ro_ro: Pentru a citi istoricul modificărilor pentru cea mai recentă versiune de plugin, accesați %s.

source: GLIM WooCommerce extension for GlimFSE Framework theme.
ro_ro: Extensie GLIM WooCommerce pentru tema GlimFSE Framework.

source: Welcome %s
ro_ro: Bun venit %s

source: You might also like
ro_ro: S-ar putea sa-ti placa si

source: Your cart is empty!
ro_ro: Coșul tău este gol!
